{
    "intents":[
        {
            "tag":"open",
            "patterns":["open","start","launch","visit"
            ],
            "responses":["open"
            ]
        },
        {
            "tag": "close",
            "patterns": ["close", "exit", "quit", "terminate"],
            "responses": ["close"]
        },
        {
            "tag": "Greetings",
            "patterns": ["good morning jarvis", "jarvis good evening", "hey jarvis good afternoon"],
            "responses": ["Thank you! It's great to see you too.",
            "Likewise! How have you been?",     
            "Thanks for the warm welcome!", 
            "Thanks! You're looking pretty awesome yourself.", 
            "Hey! It's good to be here.",
            "Thanks, I appreciate that. How's your day going so far?",
            "Thanks for the kind words. What brings you here today?",
            "Thank you for the greeting. It's always a pleasure to see you.",
            "Thank you! How have you been keeping busy lately?",  
            "Thanks for the greeting. I hope you're doing well too."]
        },
        {
            "tag": "Love",
            "patterns": ["i love you", "i like you", "i love you jarvis", "i like you jarvis"],
            "responses": ["I love you too, more than words could ever express.",   
            "You make my heart skip a beat every time I'm with you.",
            "I can't imagine my life without you in it. I love you so much.",
            "You're my everything. I love you more every day.",
            "Being with you feels like coming home. I love you more than anything.",
            "I never knew love like this until I met you. You mean everything to me.",
            "You bring so much joy and happiness to my life. I love you to the moon and back.",
            "You make me a better person every day. I love you more than anything in this world.",
            "I feel so lucky to have you in my life. I love you more than words can describe.",
            "I never believed in soulmates until I met you. I love you with all my heart and soul."]
        },
        {
            "tag": "angry",
            "patterns": ["hate you","you bloddy hell", "you idiot","fuck you man","shutup jarvis","i hate you", "fuck off jarvis", "i hate you jarvis"],
            "responses": ["I understand you're angry, and I'm here to listen. Let's talk this through.",
            "I can see that you're upset. Would you like to take a moment to calm down?",
            "I'm sorry if I did something to upset you. Can you tell me more about why you're feeling angry?",
            "I hear you, and I want to work through this with you. Let's find a solution together.",
            "I'm sorry if I contributed to your anger. Can we talk this out and find a way to move forward?",
            "I understand how you feel, and I want to work with you to make things right.",
            "I didn't mean to make you angry, and I apologize if I did. Let's work together to resolve this."]
        },
        {
            "tag": "sad",
            "patterns": ["am sad jarvis","i am sad","mood off","leave me","leave me jarvis","leave me alone","leave me alone jarvis"],
            "responses": ["I'm sorry you're feeling sad. Is there anything I can do to help?",
            "I'm here for you. Let's talk about what's making you feel sad.",
            "It's okay to feel sad sometimes. I'm here to support you.",
            "I'm sorry you're going through a tough time. Let's work together to find ways to feel better.",
            "I'm here to listen if you need someone to talk to. You don't have to go through this alone.",
            "I understand how you feel. Let's find ways to help you feel better.",
            "I'm sorry you're feeling sad. Let's take some time to do something that makes you happy.",
            "It's okay to not be okay sometimes. I'm here to offer you my support and help you through this.",
            "I'm sorry you're feeling down. Let's find some ways to lift your spirits.",
            "I care about you and I want to see you feeling better. Let's work together to find ways to help you feel more positive."]
        },
        {
            "tag": "hey",
            "patterns": ["hey jarvis", "hey", "hello", "hi", "hi jarvis", "hello jarvis", "wassup", "wassup jarvis"],
            "responses": ["hey dude!",
            "Hey! How are you doing today?",
            "Hello! It's great to see you.",
            "Hey there! What's new with you?",
            "Hello! I hope you're having a good day.",
            "Hey! I've been looking forward to seeing you.",
            "Hello! How has your week been?",
            "Hey there! It's good to catch up with you.",
            "Hello! What's on your mind today?",
            "Hey! I hope you're doing well.",
            "Hello! I'm glad we ran into each other."]
        }
    ]
}